;----------------------------------------------------
; # # DO NOT REMOVE ANYTHING FROM THIS SECTION # # # 
;----------------------------------------------------

[Variables]
@IncludeConfig=#CURRENTPATH#Config\MainConfig.inc

;----------------------------------------------------
; # # BEGIN EDITING BELOW # # # # # # # # # # # # # #
;----------------------------------------------------

NumberOfItems=1

NumberOfDividers=0

NumberOfBoxes=2

;----------------------------------------------------

ItemText1=Select Translation Language
ItemIsFolder1=1
ItemAction1=

ItemText2=
ItemIsFolder2=0
ItemAction2=#CloseMenu#

ItemText3=
ItemIsFolder3=0
ItemAction3=#CloseMenu#

ItemText4=
ItemIsFolder4=0
ItemAction4=#CloseMenu#

ItemText5=
ItemIsFolder5=0
ItemAction5=#CloseMenu#

ItemText6=
ItemIsFolder6=0
ItemAction6=#CloseMenu#

ItemText7=
ItemIsFolder7=0
ItemAction7=#CloseMenu#

ItemText8=
ItemIsFolder8=0
ItemAction8=#CloseMenu#

ItemText9=
ItemIsFolder9=0
ItemAction9=#CloseMenu#

ItemText10=
ItemIsFolder10=0
ItemAction10=#CloseMenu#

;----------------------------------------------------

BoxHeight1=70
BoxHeight2=50
BoxHeight3=50
BoxHeight4=50
BoxHeight5=50

;----------------------------------------------------
; Strings
;----------------------------------------------------

[1]

[2]

[3]

;---

[Divider1]
Meter=Shape
Shape=#DividerShape#
Y=((#DropdownItemHeight#/2)+#DividerSpace#)r

;---

[4]
Y=((#DropdownItemHeight#/2)+#DividerSpace#)R

[5]

[6]

[7]

[8]

[9]

[10]

;----------------------------------------------------
; Icons
;----------------------------------------------------

[1Icon]

[2Icon]

[3Icon]

[4Icon]
Y=[4:Y]

[5Icon]

[6Icon]

[7Icon]

[8Icon]

[9Icon]

[10Icon]

;----------------------------------------------------
; Arrows
;----------------------------------------------------

[1Arrow]

[2Arrow]

[3Arrow]

[4Arrow]

[5Arrow]

[6Arrow]

[7Arrow]

[8Arrow]

[9Arrow]

[10Arrow]

;----------------------------------------------------
; Boxes
;----------------------------------------------------

[Box1]

[MeterShape]
Meter=Shape
Shape=Rectangle 0,0,(#DropdownMenuWidth#-(#DropdownMenuCutout#*2)-((10*#DroptopSize#)*2)),(30*#DroptopSize#),(15*#DroptopSize#) | Fill Color #DropdownBGColor1#,255 | StrokeWidth 2 | Stroke Color 0,0,0,55
X=([Box1:X]+(10*#DroptopSize#))
Y=([Box1:Y]+(10*#DroptopSize#))

[MeterInputLabel]
Meter=String
StringAlign=LeftCenter
X=([Box2:X] + (10*#DroptopSize#) + (15*#DroptopSize#))
Y=(16*#DroptopSize#)r
W=(#DropdownMenuWidth#-(#DropdownMenuCutout#*2)-((25*#DroptopSize#)*2))
H=(30*#DroptopSize#)
FontColor=#DropdownFontColor1#,(#DropdownItemOpacity#/2)
FontFace=[#FontName[#AltFont[#LanguageNum]]]
FontSize=#DropdownItemFontSize#
FontWeight=#FontWeight#
InlineSetting=CharacterSpacing | #DropdownCharacterSpacing#
Padding=0,0,0,0
StringStyle=Italic
AntiAlias=#DropdownAntiAlias#
Text=Insert text
LeftMouseUpAction=[!CommandMeasure MeasureInput "ExecuteBatch 1"]
DynamicVariables=1
MouseActionCursor=1

[Box1Text]
Meter=String
StringAlign=CenterCenter
FontColor=#DropdownFontColor1#,(#DropdownItemOpacity#/3)
FontFace=[#FontName[#AltFont[#LanguageNum]]]
FontSize=#DropdownItemFontSize#
FontWeight=#FontWeight#
AntiAlias=#DropdownAntiAlias#
InlineSetting=CharacterSpacing | #DropdownCharacterSpacing#
ClipString=2
Text=Translating to "#TargetLanguage#"
X=(#DropdownMenuWidth#/2)
Y=([MeterShape:Y]+(45*#DroptopSize#))
DynamicVariables=1
Group=Box1Text

[MeasureRegistry]
Measure=Registry
RegHKey=HKEY_CURRENT_USER
RegKey=Control Panel\Desktop\WindowMetrics
RegValue=AppliedDPI
UpdateDivider=-1

[InputTextFontSize]
Measure=Calc
Formula=(((10*#DroptopSize#)-((((10*#DroptopSize#)*(((ROUND(([MeasureRegistry]/100)/0.25)))*0.25))-(10*#DroptopSize#))/2))-(((10*#DroptopSize#)-((((10*#DroptopSize#)*(((ROUND(([MeasureRegistry]/100)/0.25)))*0.25))-(10*#DroptopSize#))/2))%1))
DynamicVariables=1

[MeasureInput]
Measure=Plugin
Plugin=InputText
StringAlign=Left
FontSize=[InputTextFontSize]
X=([Box1:X]+(10*#DroptopSize#)+(15*#DroptopSize#))
Y=([MeterShape:Y]+(7*#DroptopSize#)+1)
W=(#DropdownMenuWidth#-(#DropdownMenuCutout#*2)-((10*#DroptopSize#)*2)-((15*#DroptopSize#)*2))
H=((30*#DroptopSize#)-((7*#DroptopSize#)*2))
SolidColor=#DropdownBGColor1#,255
FontColor=#DropdownFontColor1#,#DropdownItemOpacity#
DynamicVariables=1
AntiAlias=1
FocusDismiss=1
OnDismissAction=[!Redraw]
DefaultValue=
Command1=[!SetVariable Text "$UserInput$"][!WriteKeyValue Variables Text "[#Text]" "#MyVariablesLoc#"][!CommandMeasure Script "Translate"][!Update]

[Script]
Measure=Plugin
Plugin=PowershellRM
ScriptFile=#CURRENTPATH#Scripts\Translate.ps1
SourceLanguage=#SourceLanguage#
TargetLanguage=#TargetLanguage#
Text=#Text#
VarsLocation=#MyVariablesLoc#

[Box2]
Meter=Shape
Hidden=(#NumberOfBoxes#>=[##CURRENTSECTION#]?0:1)
Shape=Rectangle #DropdownMenuCutout#,(#DropdownMenuCutout#+(3*#DroptopSize#)),(#DropdownMenuWidth#+2-(#DropdownMenuCutout#*2)),([Box2Text:H]+(35*#DroptopSize#)),#DropdownBGCorner# | Fill Color #DropdownBGColor1#,(#DropdownMenuOpacity1#<1?1:#DropdownMenuOpacity1#) | StrokeWidth #DropdownStrokeWidth# | Stroke Color #DropdownStrokeColor#,#DropdownStrokeOpacity#
DynamicVariables=1
Group=Translation | Box2Group
LeftMouseUpAction=[#CopyCommand[#CopyActive]][!Update]
MouseActionCursor=1
MouseOverAction=[!SetOption #CURRENTSECTION# Shape "Rectangle #DropdownMenuCutout#,(#DropdownMenuCutout#+(3*#DroptopSize#)),(#DropdownMenuWidth#+2-(#DropdownMenuCutout#*2)),([Box2Text:H]+(35*#DroptopSize#)),#DropdownBGCorner# | Fill Color #DropdownItemHL#,(#DropdownMenuOpacity1#<1?1:#DropdownMenuOpacity1#) | StrokeWidth #DropdownStrokeWidth# | Stroke Color #DropdownStrokeColor#,#DropdownStrokeOpacity#"][!SetOption CopyIcon ImageAlpha "255"][!Update]
MouseLeaveAction=[!SetOption #CURRENTSECTION# Shape "Rectangle #DropdownMenuCutout#,(#DropdownMenuCutout#+(3*#DroptopSize#)),(#DropdownMenuWidth#+2-(#DropdownMenuCutout#*2)),([Box2Text:H]+(35*#DroptopSize#)),#DropdownBGCorner# | Fill Color #DropdownBGColor1#,(#DropdownMenuOpacity1#<1?1:#DropdownMenuOpacity1#) | StrokeWidth #DropdownStrokeWidth# | Stroke Color #DropdownStrokeColor#,#DropdownStrokeOpacity#"][!SetOption CopyIcon ImageAlpha "100"][!Update]

[Box2Text]
Meter=String
MeterStyle=TextStyle
X=(10*#DroptopSize#)r
Y=(20*#DroptopSize#)r
W=(#DropdownMenuWidth#-(28*#DroptopSize#))
ClipString=2
ClipStringW=180
Text=[#Translation[#CopyActive]]
DynamicVariables=1
Group=Translation | Box2Group
LeftMouseUpAction=[#CopyCommand[#CopyActive]][!Update]
MouseActionCursor=1

[CopyIcon]
Meter=Image
MeterStyle=CopyIconStyle
; X=(5*#DroptopSize#)r
X=(#DropdownMenuWidth#-(50*#DroptopSize#))r
; Y=(-5*#DroptopSize#)r
Y=(([Box2Text:H]/2)-(15*#DroptopSize#))r
W=(28*#DroptopSize#)
H=(28*#DroptopSize#)
ImageName=Images\copy.png
ImageAlpha=100
SolidColor=0,0,0,1
GreyScale=1
DynamicVariables=1
LeftMouseUpAction=[#CopyCommand[#CopyActive]][!Update]
Group=Translation | Box2Group
